# Напиши функцию, которая принимает имя пользователя
# и возвращает строку приветствия.

# Пример:
# Вход:
# Sher

# Ожидаемый результат:
# Привет, Sher!

def greet(name):
    print("hello,", name)

greet("Sher")
greet("Umka")
greet("La")

# Напиши функцию, которая принимает число и определяет,
# является оно чётным или нечётным.

# Пример 1:
# Вход:
# 10

# Ожидаемый результат:
# True

def is_even(num):
    return num % 2 == 0

print(is_even(10))
print(is_even(11))

# Напиши функцию, которая принимает три числа и возвращает
# самое большое из них.

# Функцию max() использовать нельзя.

# Пример:
# Вход:
# 10, 25, 7

# Ожидаемый результат:
# 25

def find_max(a,b,c):
    max_num = a
    if b > max_num:
        max_num = b
    if c > max_num:
        max_num = c
    return max_num

print(find_max(1,2,3))


# Напиши функцию деления двух чисел.

# Если второе число равно нулю, программа не должна падать.
# Обработай ошибку.

# Пример 1:
# Вход:
# 10, 2

# Ожидаемый результат:
# 5.0

# Пример 2:
# Вход:
# 10, 0

# Ожидаемый результат:
# Ошибка: делить на ноль нельзя

def div(a, b):
    try:
        return a / b
    except ZeroDivisionError:
        return "На ноль делить нельзя"

res = div(4,2) # 2
res = div(2, 0)
print(res)

# Напиши функцию, которая принимает строку и пытается
# преобразовать её в целое число.

# Если преобразование невозможно, обработай ValueError.

# Пример 1:
# Вход:
# "125"

# Ожидаемый результат:
# 125

# Пример 2:
# Вход:
# "hello"

# Ожидаемый результат:
# Ошибка: введено не число

def str_to_int(str_num):
    try:
        return int(str_num)
    except ValueError:
        return "Ошибка: введено не число"

str_to_int("1")
str_to_int("1a") # Ошибка: введено не число
 
# Напиши функцию, которая принимает список чисел
# и возвращает их среднее значение.

# Учти ситуацию, когда список пустой.

# Пример 1:
# Вход:
# [5, 4, 3, 5, 5]

# Ожидаемый результат:
# 4.4

# Пример 2:
# Вход:
# []

# Ожидаемый результат:
# Ошибка: список пуст

def average_grade(numbers):
    try:
        return sum(numbers) / len(numbers)
    except ZeroDivisionError:
        return "Ошибка: список пуст"

average_grade([5, 4, 3, 5, 5])
average_grade([]) # "Ошибка: список пуст"

# Напиши функцию, которая принимает список студентов
# и индекс.

# Функция должна вернуть имя студента по указанному индексу.

# Если такого индекса нет, обработай IndexError.

# Пример 1:
# Вход:
# ["Ali", "Bob", "Sher", "Anna"], индекс 2

# Ожидаемый результат:
# Sher

# Пример 2:
# Вход:
# ["Ali", "Bob"], индекс 10

# Ожидаемый результат:
# Ошибка: студента с таким индексом нет

def get_student(students, index):
    try:
        return students[index]
    except IndexError:
        return "Ошибка: студента с таким индексом нет"

get_student(["Ali", "Bob"], 2) # "Ошибка: студента с таким индексом нет"

# IndentationError
# if 1 == 1:
#     print()


# Напиши функцию-калькулятор.

# Функция принимает:
# - первое число;
# - второе число;
# - операцию: +, -, *, /.

# Обработай:
# - деление на ноль;
# - неизвестную операцию.

# Пример 1:
# Вход:
# 10, 5, "+"

# Ожидаемый результат:
# 15

# Пример 2:
# Вход:
# 10, 5, "*"

# Ожидаемый результат:
# 50

# Пример 3:
# Вход:
# 10, 0, "/"

# Ожидаемый результат:
# Ошибка: делить на ноль нельзя

# Пример 4:
# Вход:
# 10, 5, "@"

# Ожидаемый результат:
# Ошибка: неизвестная операция


def calculator(a, b, operator):
    try:
        if operator == '+':
            return a + b
        elif operator == '-':
            return a - b
        elif operator == '*':
            return a * b
        elif operator == '/':
            return a / b
        else:
            return "Ошибка: неизвестная операция"
    except ZeroDivisionError:
        return "Ошибка: делить на ноль нельзя"
    except TypeError:
        return "Ошибка: a и b должны быть числами"

calculator(1,2, '+') # 3
calculator(7, 0, '/') # Ошибка: делить на ноль нельзя
a = int(input("num1: "))
b = int(input("num2: "))
operator = input("operator: ")
calculator(a, b, operator)