"================Логические и условные операторы================"
# логические операторы - выражение, которые возвращают True, если выражение верное, False - если выражение не верное

"равенство"
5 == 5 # True
4 == 6 # False

"не равенство"
4 != 5 # True
5 != 5 # False

"Больше"
5 > 4 # True
5 > 10 # False
5 > 5 # False

"Меньше"
5 < 4 # False
4 < 5 # True
4 < 4 # False

"Больше или равно"
5 >= 10 # False
5 >= 5 # True

"Меньше или равно"
5 <= 10 # True
5 >= 5 # True
10 <= 5 # False

'5' == 5 # False
5 == [7,2] # False
'hello' == 'Hello' # False
'Ertay'.lower() == 'ertay'.lower() # True

"===================And Or Not==================="
# and - и
# or - или
# not - не

a = 4
b = 5
a == 5 and b == 5 # False
a == 4 and b*5 == 5*5 # True

# если выражения возвращают True - будет True
# если хотя бы одна часть выражения False - будет False

# True or False - True
a == 4 or b == 10 # True
# False or False - False
a == 5 or b == 10 # False
# если хотя бы одна часть выражения True - будет True


not (a == 4 or b == 10) and (a == 5 or b != 4) # 

not True # False
not False # True
#   True
not a == 4 # False

"================Boolean Type================"
# Булевый тип данных имеет всего 2 значения True и False
print(type(True)) # <class 'bool'>
int
str
bool
print(bool(1)) # True
print(bool(0)) # False
print(bool(-112)) # True

print(bool('hello')) # True
print(bool('        ')) # True
print(bool('')) # False

print(bool([])) # False
print(bool([[]])) # True

print(bool(True)) # True
print(bool(False)) # False

a = 0
print(bool(a)) # False

"====================None Type===================="
print(bool(None)) # False
print(bool('None')) # True

a = None
a is None # True 
a == None # True
a = 2**65
b = 2**65
print(a is b) # False
# in

"=====================Условные операторы====================="
a = 4
b = 5

if a == 4 or b == 5: 
    print("vse good")
elif a == 5:
    print("vse norm")
elif a == 5:
    print("vse norm")
else:
    print("vse ploxo")

# if условие1:
#     тело1
#     # тело1 будет выполняться только если условие1 верное

# if условие1:
#     тело1
#     # тело1 будет выполняться только если условие1 верное
# else:
#     тело2
#     # тело2 будет выполняться во всех других случаях

# if условие1:
#     тело1
#     # тело1 будет выполняться только если условие1 верное
# elif условие2:
#     тело2
#     # тело2 будет выполняться только если условие1 не верное и если условие2 верное

# if условие1:
#     тело1
#     # тело1 будет выполняться только если условие1 верное
# elif условие2:
#     тело2
#     # тело2 будет выполняться только если условие1 не верное и если условие2 верное
# else:
#     тело3
#     # тело3 будет выполняться только если все вышеуказанные условия не верные


# в одной конструкции мы можем использовать только один if
# в одной конструкции мы можем использовать неограниченное количество elif или не использовать вообще
# в одной конструкции мы можем использовать только один else или не использовать вообще

num = int(input("Введите число: "))

# if num > 0:
#     print(f"число {num} - положительное")
# elif num < 0:
#     print(f"число {num} - отрицательное")
# else:
#     print(f"число {num} - это 0")

"===================Тернарные операторы==================="
# тело1 if условие else тело2

print(f"число {num} - положительное") if num > 0 else print(f"число {num} - отрицательное")