"===================Tuple==================="
# кортеж - неизменяемый, индексируемый, итерируемый, упорядоченный тип данных, предназначенный для хранения данных в определенном порядке (в целом не отличается от списков, просто не изменяемый)

tuple1 = (1,2,3)
list1 = [1,2,3]

tuple2 = tuple('hello')
print(tuple2)
# ('h', 'e', 'l', 'l', 'o')

a = (5, 6)
print(type(a)) # <class 'tuple'>

a = (5, )
print(type(a)) # <class 'tuple'>

a = (5)
print(type(a)) # <class 'int'>

a = ('hello')
print(type(a)) # <class 'str'>

a = ('hello', 1)
print(type(a)) # <class 'tuple'>

print(dir(tuple1))
"==================Методы кортежей=================="
# count - считает количество принятого элемента в кортеже
tuple1 = (1,2,3,1,1,2,3,1,4)
print(tuple1.count(1)) # 4

# index - возвращает индекс первого найднего принятого элемента 
print(tuple1.index(2, 1, 4)) # 1
print(tuple1[4:1]) # 3

magazines = (1,2,3,4,5,6,7)